Autodesk.Revit.DB.Structure.AnalyticalModelSurface.SetLoops(Autodesk.Revit.DB.Structure.AnalyticalLoopType,System.Collections.Generic.IList`1{Autodesk.Revit.DB.CurveLoop})
Set new analytical model geometry (newLoops) for analytical surface elements such as floors and slabs.
Remarks:
Analytical surface will be automatically generated from provided newLoops.
Number of newLoops and number of curves in each newloop have to correspond to loops number with the same loopType in element.
To verify number of loops and their type use getLoops method.
Currently you can not set arbitrary shape for analytical walls. For walls false will be returned.
loopType:
Determine what kind of loops will be set. Rest of loops remain unchanged.
newLoops:
New analytical geometry for analytical surface elements.
Returns:
False if setting the new location failed for one or more curves. True if setting new location succeeded for all curves.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when number of newLoops is different from number of current loops considering loopType.
-or-
Thrown when number of curves in each loop in newLoop don't correspond to number of curves in current loop.
-or-
Thrown when type of curves in newLoop differ from number of curves in current loop (eg. line changed to arc).
-or-
Thrown when length of any curve in newLoops is invalid.
-or-
Thrown when new loops intersect themselves or intersect with loops already set in analytical model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.GetOpenings(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId}@)
Retrieves Analytical Surface Openings Identifiers valid to be used in showOpening/hideOpening functions.
openingsIds:
Set of openings Identifiers in Analytical Surface Element which are valid for hide.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalModelSurface.GetHiddenOpenings(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId}@)
Retrieves Identifiers of all hidden openings.
openingsIds:
Set of openings Identifiers which are hidden in Analytical Surface Element.
Since:
2013